      *-----------------------------------------------------------------
      * NSA 1 - ENTETE SOCIETE
      *-----------------------------------------------------------------
      *    cf. NSA-Donnees.wrk
           
           MOVE SPACE TO XMLOut-NOMSOC
           MOVE SPACE TO XMLOut-NOMAGC XMLOut-CODAGC 
           MOVE SPACE TO XMLOut-NOMREG XMLOut-CODREG 
           MOVE SPACE TO XMLOut-DEV

           MOVE RAI-MPAR TO XMLOut-NOMSOC
           MOVE ABRD-MPAR TO XMLOut-DEV

