      * -----------------------------------------------------------
      *  Copybook with arrays to test Csv Conversion
      *------------------------------------------------------------
      
       01  Test2.
           03  field-one                          pic x(20).
           03  field-two                          pic x(8).
           03  filler occurs 2 times.
               05  fld-3                          pic x(8).                     
               05  filler occurs 3 times.
                   07  Num-Fld-Four               pic 99.