      * -----------------------------------------------------------
      *  Copyboo to test Csv Conversion
      *------------------------------------------------------------
      
       01  Test1.
           03  fld1                              pic x(20).
           03  fld2                              pic x(8).
           03  fld3                              pic x(8).                     
           03  NumFld4                           pic s9(4)v99.
           03  NumFld5                           pic 99.