       FD  TRI LABEL RECORD STANDARD.
       01  ENR-TRI.
           02 CLE1-TRI.
              03 NUM-TRI     PIC 9(6).
           02 CLE2-TRI.
              03 LIB-TRI     PIC X(220).

