       FD  TRI LABEL RECORD STANDARD.
       01  ENR-TRI.
           03 SEQ-TRI PIC X(1000).
       FD  XMLOut-File2
           LABEL RECORD IS STANDARD.
       01 XMLOut-Record2    PIC  X(256).
