       FD  TRI LABEL RECORD STANDARD.
       01  ENR-TRI.
           02 CLE1-TRI.
              04 ART-TRI   PIC X(20).
           02 CLE2-TRI.
              04 DES-TRI   PIC X(40).
              04 DE2-TRI   PIC X(20).
           02 CLE3-TRI.
              04 REF-TRI   PIC X(20).

