           SELECT TRI ASSIGN TO ASSIGN-TRI
                             ORGANIZATION INDEXED
                             ACCESS DYNAMIC
                             RECORD KEY IS CLE1-TRI  
                   ALTERNATE RECORD KEY IS CLE2-TRI DUPLICATES 
                             FILE STATUS IS FILE-STATUS.


