           SELECT TRI    ASSIGN TO ASSIGN-TRI
                         ORGANIZATION INDEXED
                         ACCESS DYNAMIC
                         RECORD KEY CLE1-TRI
               ALTERNATE RECORD CLE2-TRI WITH DUPLICATES
                         FILE STATUS IS FILE-STATUS.