              SELECT TRI      ASSIGN TO  ASSIGN-TRI
                           ORGANIZATION INDEXED
                           ACCESS DYNAMIC
                           RECORD KEY IS CLE1-TRI
                           ALTERNATE RECORD KEY IS CLE2-TRI
                             WITH DUPLICATES
                           ALTERNATE RECORD KEY IS CLE3-TRI
                             WITH DUPLICATES
                           FILE STATUS FILE-STATUS.

