

        01  TESTSTRUKTUR.                                              
           10  TEXTFELD           PIC X(10).                           
           10  ZAHL1              PIC S9(11)      PACKED-DECIMAL.      
           10  ZAHL2              PIC S9(9)V9(2)  USAGE COMP-3.        
           10  DATUM              PIC X(10).                           
           10  ZAHL3              PIC 9(5).   
           