           accept W-NUMPORT-TOMCAT FROM ENVIRONMENT "NUMPORT-TOMCAT"
           IF W-NUMPORT-TOMCAT = SPACE OR ":8080"
              MOVE "8080" TO W-NUMPORT-TOMCAT
           END-IF
